m = {
"тогда и только тогда": "тоді і тільки тоді",
"в самом деле": "насправді",
"В самом деле": "Насправді",
"На самом деле": "Насправді",
"на самом деле": "насправді",
"т.е.": "тобто",
"г.": "р.",
"паросочетание": "паросполука", # cnt=79
"подстроки": "підстрічки", # cnt=64
"см.": "див.", # cnt=63
"подстрок": "підстрічок", # cnt=53
"остов": "каркас", # cnt=37
"дан": "дано", # cnt=36
"подстрока": "підстрічка", # cnt=23
"Гаусса": "Гауса", # cnt=18
"нима": "німа", # cnt=18
"факторизации": "факторизації", # cnt=17
"многочлена": "багаточлена", # cnt=17
"подотрезке": "підвідрізку", # cnt=17
"Прима": "Прима", # cnt=17
"Лемма": "Лема", # cnt=16
"подстроку": "підстрічку", # cnt=14
"бор": "префіксне дерево", # cnt=13
"подотрезка": "підвідрізку", # cnt=13
"поддереве": "піддереві", # cnt=12
"БПФ": "ШПФ", # cnt=11
"Кирхгофа": "Кірхгофа", # cnt=11
"поддерево": "піддерево", # cnt=10
"ациклический": "ациклічний", # cnt=9
"остовом": "каркасом", # cnt=9
"связностью": "зв'язністю", # cnt=8
"диофантова": "діофантова", # cnt=8
"первообразного": "первісного", # cnt=8
"Полларда": "Поларда", # cnt=8
"многочлен": "багаточлен", # cnt=8
"подотрезок": "підвідрізок", # cnt=8
"остовное": "каркасне", # cnt=8
"приведена": "наведено", # cnt=7
"суффиксу": "суфіксу", # cnt=7
"скобочной": "дужковій", # cnt=7
"Ривест": "Рівест", # cnt=7
"лемму": "лему", # cnt=7
"подотрезков": "підвідрізків", # cnt=7
"центроид": "центроїд", # cnt=7
"листом": "листком", # cnt=6
"рекурсивную": "рекурсивну", # cnt=6
"битами": "бітами", # cnt=6
"псевдопростое": "псевдопросте", # cnt=6
"Согласно лемме": "Згідно з лемою", # cnt=6
"согласно лемме": "згідно з лемою", # cnt=6
"поразрядно": "порозрядно", # cnt=6
"остову": "каркасу", # cnt=6
"рекурсию": "рекурсію", # cnt=6
"палиндромов": "паліндромів", # cnt=6
"декартово": "декартове", # cnt=6
"противника": "суперника", # cnt=6
"подмасок": "підмасок", # cnt=5
"троичной": "трійковій", # cnt=5
"умножений": "множень", # cnt=5
"рекуррентную": "рекурентну", # cnt=5
"домножать": "домножувати", # cnt=5
"оффлайн": "офлайн", # cnt=5
"НОД": "НСД", # cnt=5
"НОК": "НСК", # cnt=5
"полиномов": "поліномів", # cnt=5
"итеративно": "ітеративно", # cnt=5
"поддерева": "піддерева", # cnt=5
"паттернам": "патернам", # cnt=5
"ч.т.д": "що і треба було довести", # cnt=5
"Укконена": "Уконена", # cnt=5
"диагоналях": "діагоналях", # cnt=4
"исходник": "код", # cnt=4
"абсциссе": "абсцисі", # cnt=4
"факторизация": "факторизація", # cnt=4
"целочисленного": "цілочисельного", # cnt=4
"бите": "біті", # cnt=4
"многоугольнику": "багатокутнику", # cnt=4
"итерацией": "ітерацією", # cnt=4
"каскадирования": "каскадування", # cnt=4
"подотрезках": "підвідрізках", # cnt=4
"суффиксам": "суфіксам", # cnt=4
"декартова": "декартового", # cnt=4
"битовая запись": "бітовий запис", # cnt=3
"двудольного": "дводольного", # cnt=3
"ациклического": "ациклічного", # cnt=3
"булевский": "булевий", # cnt=3
"целочисленной": "цілочисельній", # cnt=3
"факторизацию": "факторизацію", # cnt=3
"делителям": "дільникам", # cnt=3
"В итоге": "В результаті",
"Во избежание": "Щоб уникнути",
"верно и обратное": "правильне і протилежне",
"Верно и обратное": "Правильне і протилежне",
"по модулю": "за модулем",
}
